Repository: najamelan/vhffs-4.5
Catalog: branches/vhffs-4.5/vhffs-intl/*.po
Languages: fr_fr

source: RIGHT can be subscriber or admin
fr_fr: RIGHT peut être inscrit ou admin

source: %s-request@%s with the following subject : "subscription accept %s %s"
fr_fr: %s-request@%s Avec le sujet suivant : "Inscription acceptée %s %s"

source: %s-request@%s with the following subject : "subscription refuse %s %s"
fr_fr: %s-request@%s Avec le sujet suivant : "Inscription refusée %s %s"

source: %s has been added
fr_fr: %s a été ajouté

source: %s is already a member of this list
fr_fr: %s est déjà un membre de la liste

source: %s is not a valid mail
fr_fr: %s n'est pas une adresse email valide

source: %s's Panel
fr_fr: Panel de %s

source: %s-request@%s with subject "help"
fr_fr: %s-request@%s Avec pour sujet "help"

source: 10 most used tags:
fr_fr: 10 tags les plus utilisés:

source: <new site>.%s
fr_fr: <nouveau site>.%s

source: @ represents the ORIGIN (%s).
fr_fr: @ représente l'ORIGINE (%s).

source: A CNAME, A or AAAA record with the same name already exists for this domain
fr_fr: Un enregistrement CNAME, A ou AAAA avec le même nom existe déjà pour ce domaine

source: A Record deleted
fr_fr: Enregistrement A supprimé

source: A Record updated
fr_fr: Enregistrement A mis à jour

source: A TXT record with the same name already exists for this domain
fr_fr: Il existe déjà un enregistrement TXT avec le même nom pour ce domaine.

source: A mail to moderate is on the following mailing list: %s
fr_fr: Il y a un mail à modérer dans la liste suivante : %s

source: A new person wants to subscribe to the following mailing list: %s
fr_fr: Une personne souhaite s'inscrire à la liste de diffusion suivante: %s

source: A record added
fr_fr: Enregistrement A ajouté

source: A records (name -> IPv4)
fr_fr: Enregistrements A (nom -> IPv4)

source: AAAA Record deleted
fr_fr: Enregistrement AAAA supprimé

source: AAAA Record updated
fr_fr: Enregistrement AAAA mis à jour

source: AAAA record added
fr_fr: Enregistrement AAAA ajouté

source: AAAA records (name -> IPv6)
fr_fr: Enregistrements AAAA (nom -> IPv6)

source: ACL Administration
fr_fr: Administration des ACL

source: ACL added
fr_fr: ACL ajoutée

source: ACL deleted
fr_fr: ACL supprimée

source: ACL only describes right at panel level. They do not enforce any filesystem permissions, use FTP and/or SSH for this.
fr_fr: Les ACL représentent uniquement les droits sur le panel. Ils n'agissent en rien sur les autorisations du système de fichiers, utilisez FTP et/ou SSH pour cela.

source: ACL updated
fr_fr: ACL mise à jour

source: Absolute path of the command to run
fr_fr: Chemin absolu de la commande à exécuter

source: Accept
fr_fr: Accepter

source: Access denied
fr_fr: Accès refusé

source: Access rights management for this object
fr_fr: Gestion des droits d'accès pour cet objet

source: Access to panel
fr_fr: Accéder au panel

source: Account created on %s
fr_fr: Compte créé sur %s

source: Account successfully created
fr_fr: Compte créé avec succès

source: Accounts
fr_fr: Comptes

source: Activate %s@%s email
fr_fr: Activer l'adresse email %s@%s

source: Activate anti-spam protection
fr_fr: Utiliser la protection antispam

source: Activate anti-virus protection
fr_fr: Utiliser la protection antivirus

source: Activated
fr_fr: Activé

source: Activated Bazaar:
fr_fr: Bazaar activés:

source: Activated CVS:
fr_fr: CVS activés:

source: Activated DNS:
fr_fr: DNS activés:

source: Activated Git:
fr_fr: Git activés:

source: Activated Mercurial:
fr_fr: Mercurial activés:

source: Activated MySQL DBs:
fr_fr: Bases MySQL activées:

source: Activated PostgreSQL DBs:
fr_fr: Bases PostgreSQL activées:

source: Activated SVN:
fr_fr: SVN activés:

source: Activated groups:
fr_fr: Groupes activés:

source: Activated lists:
fr_fr: Listes de diffusion activées:

source: Activated mail domains:
fr_fr: Domaines mail activés:

source: Activated webareas:
fr_fr: Espaces web activés:

source: Add
fr_fr: Ajouter

source: Add "Reply-To" header
fr_fr: Ajouter "Reply-To" vers la liste

source: Add a A record
fr_fr: Ajouter un enregistrement A

source: Add a AAAA record
fr_fr: Ajouter un enregistrement AAAA

source: Add a CNAME record
fr_fr: Ajouter un enregistrement CNAME

source: Add a MX record
fr_fr: Ajouter un enregistrement MX

source: Add a NS record
fr_fr: Ajouter un enregistrement NS

source: Add a SRV record
fr_fr: Ajouter un enregistrement SRV

source: Add a TXT record
fr_fr: Ajouter un enregistrement TXT

source: Add a catchall box
fr_fr: Ajouter une boîte fourre-tout

source: Add a category.
fr_fr: Ajouter une catégorie.

source: Add a tag
fr_fr: Ajouter un tag

source: Add a user in this group
fr_fr: Ajouter un utilisateur dans ce groupe

source: Add an account
fr_fr: Ajouter un compte

source: Add forward
fr_fr: Ajouter une redirection

source: Add mailbox
fr_fr: Ajouter une boîte mail

source: Add members
fr_fr: Ajouter les membres

source: Add record
fr_fr: Ajouter un enregistrement

source: Add them!
fr_fr: Ajoutez-les!

source: Address (Servername):
fr_fr: Adresse (Servername):

source: Address is not correct !
fr_fr: L'adresse est invalide !

source: Address:
fr_fr: Adresse:

source: Addresses (one per line):
fr_fr: Adresses (une par ligne);

source: Admin
fr_fr: Administration

source: Admin Download repository
fr_fr: Administration des espaces de téléchargement

source: Admin account
fr_fr: Compte administrateur

source: Administration for list %s
fr_fr: Administration de la liste %s

source: Administrator
fr_fr: Administrateur

source: Administrators
fr_fr: Administrateurs

source: Administrators:
fr_fr: Administrateurs:

source: Admins only
fr_fr: Aministrateurs seuls

source: Advanced search
fr_fr: Recherche avancée

source: All
fr_fr: Tous

source: All commands can be sent as mail subject.
fr_fr: Toutes les commandes peuvent être envoyées en sujet d'un mail.

source: All groups
fr_fr: Tous les groupes

source: All mails with commands must be sent on YOURLIST-request@domain.tld list.
fr_fr: Tous les mails contenant des commandes doivent être envoyés à l'adresse VOTRELISTE-request@domain.tld.

source: An MX record with the same name already exists for this domain
fr_fr: Un enregistrement MX avec le même nom existe déjà pour ce domaine.

source: An NS record with the same name already exists for this domain
fr_fr: Un enregistrement NS avec le même nom existe déjà pour ce domaine.

source: An error occured during CVS repository update
fr_fr: Une erreur est survenue lors de la mise à jour du CVS

source: An error occured during your approval of subscription of: %s into the following mailing list: %s
fr_fr: Une erreur s'est produite lors de votre approbation d'inscription à : %s à cette liste de diffusion : %s

source: An error occured during your subscription to the following list: %s
fr_fr: Une erreur est survenue lors de votre inscription à cette liste de diffusion: %s

source: An error occured while adding the box
fr_fr: Une erreur est survenue lors de l'ajout de la boîte

source: An error occured while adding the box (anti-spam or anti-virus adding)
fr_fr: Une erreur est survenue lors de l'ajout de la boîte mail (concernant l'ajout antispam ou antivirus)

source: An error occured while adding the catchall box
fr_fr: Une erreur est survenue lors de l'ajout de la boîte fourre-tout

source: An error occured while applying changes. This user will NOT be deleted
fr_fr: Une erreur est survenue lors de l'enregistrement des modifications.L'utilisateur NE sera PAS supprimé.

source: An error occured while changing the box password
fr_fr: Une erreur est survenue lors du changement du mot de passe de la boîte mail

source: An error occured while creating the bazaar repository
fr_fr: Une erreur est survenue lors de la mise a jour du dépôt Bazaar

source: An error occured while creating the git repository
fr_fr: Une erreur est survenue lors de la mise a jour du dépôt Git

source: An error occured while creating the mail area
fr_fr: Une erreur est survenue lors de la création du domaine mail

source: An error occured while creating the mercurial repository
fr_fr: Une erreur est survenue lors de la mise a jour du dépôt Mercurial

source: An error occured while creating the object. Check that this group doesn't already have a download repository
fr_fr: Une erreur est survenue lors de la création de cet objet. Veuillez verifier que ce groupe n'a pas déjà un dépôt de téléchargements

source: An error occured while creating the object. The domain is not correct or aleady exists in Vhffs database
fr_fr: Une erreur est survenue lors de la création de l'objet. Le domaine est incorrect ou existe déjà sur cette plate-forme

source: An error occured while creating the object.It probably already exists
fr_fr: Une erreur est survenue lors de la création de cet objet. Il existe probablement déjà

source: An error occured while creating the svn repository
fr_fr: Une erreur est survenue lors de la création du dépôt SVN

source: An error occured while deleting this mailing
fr_fr: Une erreur est survenue lors de la suppression du mailing

source: An error occured while deleting this object
fr_fr: Une erreur est survenue pendant la suppression de cet objet

source: An error occured while deleting this object.
fr_fr: Une erreur est survenue lors de la suppression de cet objet

source: An error occured while fetching the catchall box
fr_fr: Une erreur est survenue lors de la récupération de la boîte fourre-tout

source: An error occured while saving your request
fr_fr: Une erreur s'est produite lors de l'enregistrement de votre requête.

source: An error occured while updating language for the following address: %s.
fr_fr: Une erreur est survenue lors de la mise à jour de la langue pour l'adresse suivante : %s.

source: An error occured while updating localpart %s
fr_fr: Une erreur est survenue lors de la mise à jour de la partie locale %s

source: An error occured while updating the project
fr_fr: Une erreur est survenue lors de la mise à jour du projet

source: An error occured while updating the redirect
fr_fr: Une erreur est survenue pendant la mise à jour de la redirection

source: An error occured while updating the user account
fr_fr: Une erreur est survenue lors de la mise à jour du compte utilisateur

source: An error occured while updating this object.
fr_fr: Une erreur est survenue lors de la mise à jour de cet objet

source: Are you SURE you want DELETE this user?
fr_fr: Êtes-vous CERTAIN de vouloir SUPPRIMER cet utilisateur ?

source: Are you SURE you want to DELETE this object?
fr_fr: Êtes-vous vraiment sûr de vouloir supprimer cet objet ?

source: Avatar deleted
fr_fr: Avatar supprimé

source: Avatar management
fr_fr: Gestion des avatars

source: Awaiting sending
fr_fr: En attente d'envoi

source: Back to login
fr_fr: Retour à l'identification

source: Back to login page
fr_fr: Retour à la page d'authentification

source: Bad password, should be at least 3 chars
fr_fr: Mauvais mot de passe, il doit contenir au moins 3 caractères

source: Bazaar Admin
fr_fr: Administration des dépôts Bazaar

source: Bazaar Repository
fr_fr: Dépôt Bazaar

source: Bazaar repositories
fr_fr: Dépôts Bazaar

source: Bazaar repositories administration
fr_fr: Gestion des dépôts Bazaar

source: Bazaar repositories for %s
fr_fr: Dépôts Bazaar pour %s

source: Bazaar search
fr_fr: Recherche de dépots Bazaar

source: Bazaar waiting for moderation:
fr_fr: Dépôts Bazaar en attente de modération:

source: Be careful ! You must give the reason why you want to host this domain on our servers.
fr_fr: Faites attention ! Vous devez donner la raison pour laquelle vous voulez héberger ce domaine sur nos serveurs.

source: Be careful, if you want to create www.domain.tld, you should create a webspace with domain.tld as servername. VHFFS aliases www.domain.tld to domain.tld.
fr_fr: Soyez attentif, si vous souhaitez créer un site web de la forme www.domaine.tld vous devez demander le site web domaine.tld à la place. Tous les sites web en domaine.tld répondent de la même façon sur www.domaine.tld (alias de site).

source: Body
fr_fr: Corps du message

source: Body:
fr_fr: Corps:

source: Box
fr_fr: Boîte

source: Box %s deleted
fr_fr: La boite %s a été supprimée

source: Box password updated
fr_fr: La boite a été mise a jour

source: Box successfully added
fr_fr: La boite a été ajoutée

source: But fortunately we're smart, so just type your login here and a new password will be sent to you by email!
fr_fr: Mais bien heureusement, nous sommes prévoyants, alors tapez votre login ici et un nouveau mot de passe vous sera envoyé par email!

source: By
fr_fr: Par

source: CGI Error
fr_fr: Erreur CGI

source: CGI Error !
fr_fr: Erreur CGI !

source: CGI Error!
fr_fr: Erreur CGI !

source: CGI error
fr_fr: Erreur CGI

source: CGI error !
fr_fr: Erreur CGI !

source: CNAME Record added
fr_fr: Enregistrement CNAME ajouté

source: CNAME Record deleted
fr_fr: Enregistrement CNAME supprimé

source: CNAME Record updated
fr_fr: Enregistrement CNAME mis à jour

source: CNAME records (aliases)
fr_fr: Enregistrements CNAME (alias)

source: CVS Admin
fr_fr: Administration des dépôts CVS

source: CVS Repositories
fr_fr: Dépôts CVS

source: CVS Repository
fr_fr: Dépôt CVS

source: CVS repositories
fr_fr: Dépôts CVS

source: CVS repositories administration
fr_fr: Administration des dépôts CVS

source: CVS repositories for %s
fr_fr: Dépôts CVS pour %s

source: CVS search
fr_fr: Recherche de dépôts CVS

source: CVS waiting for moderation:
fr_fr: Dépôts CVS en attente de modération:

source: Can destroy this service
fr_fr: Peut détruire ce service

source: Can manage ACL for this service
fr_fr: Peut gérer les ACL pour ce service

source: Can modify this service
fr_fr: Peut modifier ce service

source: Can view this service
fr_fr: Peut voir ce service

source: Can't access
fr_fr: Ne peut pas accéder

source: Cancel
fr_fr: Annuler

source: Cancel request
fr_fr: Annuler la demande

source: Cannot apply changes to the user
fr_fr: Impossible d'appliquer les modifications à cet utilisateur

source: Cannot create session file, please check that /tmp is readable and writeable
fr_fr: Impossibilité de créer le fichier de session, veuillez vérifier que /tmp est accessible en lecture et écriture.

source: Cannot create user, the username you entered already exists
fr_fr: Impossible de créer l'utilisateur. Le nom d'utilisateur que vous avez entré est déjà pris

source: Cannot delete this avatar
fr_fr: Impossible de supprimer cet avatar

source: Cannot fetch session file, please check that /tmp is readable and writeable
fr_fr: Impossibilité de récupérer le fichier de session, veuillez vérifier que /tmp est accessible en lecture et écriture.

source: Cannot get information on this object
fr_fr: Impossible d'obtenir des informations sur cet objet

source: Cannot get informations on object #%d
fr_fr: Impossible d'obtenir des informations sur l'objet #%d

source: Cannot get informations on this object
fr_fr: Impossible d'obtenir des informations sur cet objet

source: Cannot get statistics
fr_fr: Impossible d'obtenir les statistiques

source: Cannot retrieve informations about this object
fr_fr: Impossible de récupérer des informations sur cet object

source: Cannot send message, CGI error...
fr_fr: Impossible d'envoyer le message, erreur CGI...

source: Catchall %s deleted
fr_fr: Fourre-tout %s supprimé

source: Catchall address
fr_fr: Adresse de type catchall

source: Catchall address receive all emails for which no box nor forward exists on this domain.
fr_fr: L'adresse fourre-tout récupère tous les mails pour lesquels il n'existe ni boîte ni redirection sur ce domaine.

source: Catchall box successfully added
fr_fr: Boîte fourre-tout ajoutée avec succès

source: Catchall destination address:
fr_fr: Adresse de destination fourre-tout:

source: Categories:
fr_fr: Catégories:

source: Category
fr_fr: Catégorie

source: Category can't be empty
fr_fr: La catégorie ne peut pas être vide

source: Category deleted
fr_fr: Catégorie supprimée

source: Category does not exists
fr_fr: La catégorie n'existe pas.

source: Category label
fr_fr: Étiquette de la catégorie

source: Category not found
fr_fr: Catégorie non trouvée

source: Category not found!
fr_fr: Catégorie non trouvée !

source: Category:
fr_fr: Catégorie:

source: Change user ID
fr_fr: Changer d'utilisateur

source: Change user-id
fr_fr: Changer d'identifiant utilisateur

source: Changed anti-virus status for your account
fr_fr: Protection antivirus sur le compte modifiée

source: Changed spam protection status for your account
fr_fr: Protection antispam sur le compte modifiée

source: City is not correct !
fr_fr: Ville incorrecte !

source: City:
fr_fr: Ville:

source: Closed
fr_fr: Fermées

source: Codes do not match
fr_fr: Les codes ne correspondent pas

source: Collided, something went wrong, recovering
fr_fr: Entré en collision, qqc s'est mal passé, restauration

source: Confirmation code was wrong.
fr_fr: Le code de confirmation était faux.

source: Country is not correct !
fr_fr: Le pays est incorrect !

source: Country:
fr_fr: Pays:

source: Create
fr_fr: Créer

source: Create Tag Category
fr_fr: Créer une catégorie de tags

source: Create a CVS Repository
fr_fr: Créer un dépôt CVS

source: Create a Cron job
fr_fr: Créer un job Cron

source: Create a Download Repository
fr_fr: Créer un espace de téléchargement

source: Create a Project
fr_fr: Créer un groupe/projet

source: Create a mail space
fr_fr: Créer un espace mail

source: Create a web space
fr_fr: Créer un site web

source: Create category
fr_fr: Créer une catégorie

source: Create new category
fr_fr: Créer une nouvelle catégorie

source: Create new project
fr_fr: Créer un nouveau projet

source: Create new tag
fr_fr: Créer un nouveau tag

source: Create new tag.
fr_fr: Créer un tag.

source: Create tag
fr_fr: Créer un tag

source: Creation error
fr_fr: Erreur lors de la création

source: Cron job
fr_fr: Tâche cron

source: Cron job Administration
fr_fr: Administration des jobs Cron

source: Cron job successfully updated
fr_fr: Job Cron mis à jour avec succès

source: Cron jobs administration
fr_fr: Administration des tâches cron

source: Cron jobs for %s
fr_fr: Jobs Cron pour %s

source: Cron search
fr_fr: Recherche de tâches cron

source: Crons Admin
fr_fr: Administration des Crons

source: Current avatar
fr_fr: Avatar utilisé

source: Current logo
fr_fr: Logo actuel

source: Current members
fr_fr: Membres actuels

source: Current tags for this project
fr_fr: Tags actuels sur ce projet

source: DNS Admin
fr_fr: Administration DNS

source: DNS Administration - %s
fr_fr: Administration DNS - %s

source: DNS administration
fr_fr: Administration DNS

source: DNS search
fr_fr: Recherche de DNS

source: DNS servers:
fr_fr: Serveurs DNS :

source: DNS waiting for moderation:
fr_fr: DNS en attente de modération:

source: Database error
fr_fr: Erreur de base de données

source: Date of creation
fr_fr: Date de création

source: Default
fr_fr: Défaut

source: Delete
fr_fr: Supprimer

source: Delete YOUR user
fr_fr: Supprimer votre compte utilisateur

source: Delete avatar for this object
fr_fr: Supprimer l'avatar de cet objet

source: Delete forward
fr_fr: Supprimer cette redirection

source: Delete from list
fr_fr: Supprimer de la liste

source: Delete my user
fr_fr: Supprimer cet utilisateur

source: Delete this catchall box
fr_fr: Supprimer cette boîte fourre-tout

source: Delete this mail account
fr_fr: Supprimer ce compte mail

source: Delete this object
fr_fr: Supprimer cet objet

source: Deletion error
fr_fr: Erreur de suppression

source: Description of your web area:
fr_fr: Description de l'espace web:

source: Dl repos
fr_fr: Espaces de téléchargement

source: Domain Name
fr_fr: Nom de domaine

source: Domain name:
fr_fr: Nom de domaine:

source: Domain names for %s
fr_fr: Noms de domaine pour %s

source: Domain:
fr_fr: Domaine:

source: Don't forget to subscribe %s to your mailing list if you are filtering posts.
fr_fr: N'oubliez pas d'inscrire %s sur votre liste de diffusion si vous filtrez les messages.

source: Don't subscribe to the newsletter
fr_fr: Ne pas souscrire à la newsletter

source: Download Repository
fr_fr: Espace de téléchargement

source: Download repositories Admin
fr_fr: Administration des espaces de téléchargement

source: Download repositories administration
fr_fr: Administration des espaces de téléchargements

source: Download repositories for %s
fr_fr: Espaces de téléchargement pour %s

source: Download repositories search
fr_fr: Recherche d'espaces de téléchargements

source: Edit
fr_fr: Éditer

source: Email address changed
fr_fr: Adresse mail mise à jour

source: Email address:
fr_fr: Adresse email:

source: Email is not correct !
fr_fr: Adresse mail invalide !

source: Email to which send a report if something goes wrong
fr_fr: Adresse email sur laquelle envoyer le rapport si quelque chose se passe mal

source: Enable antispam?
fr_fr: Activer l'antispam?

source: Enable antivirus?
fr_fr: Activer l'antivirus?

source: Error creating group (maybe a group with the same name already exists)
fr_fr: Erreur lors de la création du groupe (un groupe du même nom existe peut être déjà).

source: Error creating webarea.
fr_fr: Erreur lors de la création de l'espace web.

source: Error for spam protection
fr_fr: Erreur sur protection spam

source: Error for virus protection
fr_fr: Erreur sur protection virus

source: Error when uploading avatar for this object
fr_fr: Erreur d'envoi d'avatar pour cet objet

source: Error while activating object
fr_fr: Erreur lors de l'activation de cet objet

source: Error while creating object
fr_fr: Erreur pendant la création de l'objet

source: Error while modifying object
fr_fr: Erreur pendant la modification de l'objet

source: Error while queuing mailing
fr_fr: Erreur d'ajout de l'envoi en masse à la queue

source: Error while suspending object
fr_fr: Erreur lors de la suspension de cet objet

source: Error while updating object
fr_fr: Erreur pendant la modification de l'objet

source: Error. This group doesn't exists
fr_fr: Erreur. Ce groupe n'existe pas

source: Event
fr_fr: Événement

source: Existing A records
fr_fr: Enregistrements A existants

source: Existing AAAA records
fr_fr: Enregistrements AAAA existants

source: Existing MX records for this domain
fr_fr: Enregistrements MX existants

source: Existing SRV records for this domain
fr_fr: Enregistrements SRV existants

source: Existing TXT records
fr_fr: Enregistrements TXT existants

source: Expired session ! Please login again
fr_fr: Session expirée. Merci de vous authentifier à nouveau

source: Filetype not supported, only png is supported
fr_fr: Type de fichier non supporté, seul le png est supporté

source: Fill with project's members emails
fr_fr: Remplir avec les emails des membres du projet

source: First name
fr_fr: Prénom

source: First of all, you'll have to buy and set up your domain to a registrar.
fr_fr: Avant tout, vous devez acheter et configurer un domaine à un registrar.

source: Firstname is not correct !
fr_fr: Prénom incorrect !

source: Firstname:
fr_fr: Prénom:

source: Forward %s successfully updated
fr_fr: Redirection %s mise à jour

source: Forward %s to %s deleted
fr_fr: Redirection %s vers %s supprimée

source: Forward added
fr_fr: Redirection ajoutée

source: Forward emails from %s@%s to
fr_fr: Rediriger les mails depuis %s@%s vers

source: Forward emails from %s@%s to %s
fr_fr: Rediriger les emails de %s@%s à %s

source: Forward to address:
fr_fr: Rediriger vers l'adresse:

source: Forwards:
fr_fr: Redirections:

source: Full history
fr_fr: Historique complet

source: GIT Repositories
fr_fr: Dépôts Git

source: GIT Repository
fr_fr: Dépôt Git

source: General
fr_fr: Général

source: General information
fr_fr: Informations générales

source: Get Statistics
fr_fr: Afficher les statistiques

source: Get statistics
fr_fr: Lire statistiques
