Repository: najamelan/vhffs-4.5
Catalog: branches/vhffs-4.5/vhffs-intl/*.po
Languages: fr_fr

source: Git Admin
fr_fr: Administration des dépôts Git

source: Git repositories
fr_fr: Dépôts Git

source: Git repositories administration
fr_fr: Administration des dépôts Git

source: Git repositories for %s
fr_fr: Dépôts Git pour %s

source: Git search
fr_fr: Recherche de dépôts Git

source: Git waiting for moderation:
fr_fr: Dépôts Git en attente de modération:

source: Give me a new password!
fr_fr: Donnez moi un nouveau mot de passe!

source: Go to administration
fr_fr: Aller à la page d'administration

source: Greetings, You've been added to the list %s on platform %s. You may get some help on listengine by sending an email to %s-request@%s with subject help. Cheers.
fr_fr: Bonjour, Vous avez été ajouté à la liste %s sur la plateforme %s. Vous pouvez obtenir de l'aide sur listengine en envoyant un mail à %s-request@%s avec pour sujet help. Amicalement.

source: Group
fr_fr: Groupe

source: Group %s
fr_fr: Groupe %s

source: Group Admin
fr_fr: Administration des groupes

source: Group logo
fr_fr: Logo du groupe

source: Group not found
fr_fr: Groupe non trouvé

source: Group or user not found
fr_fr: Groupe ou utilisateur introuvable

source: Group owning this cron job:
fr_fr: Groupe possédant cette tâche cron:

source: Group owning this database:
fr_fr: Groupe possédant cette base de donnée:

source: Group owning this domain:
fr_fr: Groupe possédant ce domaine:

source: Group owning this mail domain:
fr_fr: Groupe possédant ce domaine mail:

source: Group owning this mailing list:
fr_fr: Groupe possédant cette liste de diffusion:

source: Group owning this repository:
fr_fr: Groupe possédant ce dépôt:

source: Group quota
fr_fr: Quota du groupe

source: Group updated
fr_fr: Groupe mis à jour

source: Group updated, please wait while quota is updated on filesystem
fr_fr: Groupe mis à jour. Veuillez patienter pendant la mise à jour du quota sur le système de fichiers.

source: Groupname
fr_fr: Nom du groupe

source: Groupname must contain between 3 and 12 characters, only letters or numbers in lower case
fr_fr: Le nom de groupe doit contenir entre 3 et 12 caractères, comprenant uniquementdes chiffres et des lettres en minuscule

source: Groups
fr_fr: Groupes

source: Groups search
fr_fr: Recherche de groupes

source: Groups' administration
fr_fr: Administration des groupes

source: Hello %s %s, We are pleased to announce that your account is now fully created on %s. You can now login on the panel. %s Administrators
fr_fr: Bonjour %s %s, Nous avons l'honneur de vous annoncer que votre compte est maintenant complètement créé sur %s. Vous pouvez maintenant vous loguer sur le panel. Les administrateurs de %s

source: Hello %s %s, You changed your email, here are your new personal information : User: %s Mail: %s VHFFS administrators
fr_fr: Bonjour %s %s, Vous avez modifié votre email. Voici un rappel de vos informations : Utilisateur: %s Adresse mail: %s Les administrateurs

source: Hello %s %s, Your %s (%s) on %s has been deleted. This is because it have been refused a long time ago and you didn't submit an update since. For reminder, the reason of refusal was: %s Don't be upset, submit it again if you forgot to update it in time. If you need further information, just reply to this email ! %sCheers, The moderator team --------- %s %s
fr_fr: Bonjour %s %s, Votre %s (%s) sur %s a été supprimé. La raison est qu'il a été refusé il y a déjà bien longtemps et qu'il n'a pas été reproposé en validation. Pour rappel, la raison du refus était: %s Ne soyez pas fâché, proposer le de nouveau si vous n'avez pu le reproposer à temps. Si vous avez besoin de plus d'information, repondez à ce mail ! %sSalutations, L'équipe de modération --------- %s %s

source: Hello %s %s, Your %s (%s) on %s was successfully created. %sEnjoy! Cheers, The moderator team --------- %s %s
fr_fr: Bonjour %s %s, Votre %s (%s) sur %s a été créé avec succès. %sEnjoy! Salutations, L'équipe de modération --------- %s %s

source: Hello %s %s, Your account (%s) on %s has been deleted. This is because it was left unused for a long time Don't be upset, create it again and reply to this email to tell us why you really need to keep your account. If you need further information, just reply to this email ! Cheers, The moderator team --------- %s %s
fr_fr: Bonjour %s %s, Votre compte (%s) sur %s à été supprimé. Car cet utilisateur n'a pas été utilisé depuis très longtemps Ne soyez pas faché, créez le de nouveau et repondez à ce mail en nous expliquant pourquoi vous avez vraiment besoin de conserver votre compte. Si vous avez besoin d'informations complémentaires, repondez simplement à ce mail ! Cordialement, L'équipe de modération --------- %s %s

source: Hello %s %s, Your request for a %s (%s) on %s was accepted, however, moderators wanted to add some precision: %s. %sPlease wait while we are creating your object. Cheers, The moderator team --------- %s %s
fr_fr: Bonjour %s %s, Votre demande pour un %s (%s) sur %s a été acceptée, toutefois, lesmodérateurs ont souhaité ajouter une précision: %s. %sMerci de patientr pendant que nous créons votre objet. Salutations, L'équipe de modération --------- %s %s

source: Hello %s %s, Your request for a %s (%s) on %s was accepted. %sPlease wait while we are creating your object. Cheers, The moderator team --------- %s %s
fr_fr: Bonjour %s %s, Votre demande pour un %s (%s) sur %s a été acceptée. %sMerci de patientr pendant que nous créons votre objet. Salutations, L'équipe de modération --------- %s %s

source: Hello %s %s, Your request for a %s (%s) on %s was refused. The reason of refusal given by moderators is: %s You can change the description and submit it again for moderation on the panel. You can delete this object on the panel if you have made a mistake. Don't be upset, if you don't understand why your request has been refused, just reply to this email ! %sCheers, The moderator team --------- %s %s
fr_fr: Bonjour %s %s, Votre demande pour un %s (%s) sur %s a été refusée. La raison du refus donnée par les modérateurs est: %s Vous pouvez changer la description et resoumettre en modération sur le panel. Vous pouvez supprimer cet objet sur le panel si vous avez fait une erreur. Ne soyez pas fâché, si vous ne comprenez pas pourquoi votre demande a été refusée, repondez à ce mail ! %sSalutations, L'équipe de modération --------- %s %s

source: Hello %s %s, Welcome on %s Here are your login information : User: %s Password: %s Your account is NOT created yet, you cannot login on the panel now, you are going to receive another mail in a few minutes upon account creation. %s Administrators
fr_fr: Bonjour %s %s, Bienvenue sur %s Voici vos informations de login : Utilisateur: %s Mot de passe: %s Votre compte n'est PAS encore créé, vous ne pouvez pour l'instant pas vous loguer, vous allez recevoir un autre mail dans quelques minutes une fois votre compte créé. Les administrateurs de %s

source: Hello and welcome on listengine help
fr_fr: Bonjour et bienvenue dans l'aide de listengine

source: Help
fr_fr: Aide

source: Here are the basic listengine commands:
fr_fr: Voici les commandes basiques de listengine :

source: Here, you can send a message to the admin team
fr_fr: Ici, vous pouvez envoyer un message à l'équipe d'administration

source: His email address is: %s
fr_fr: Son adresse email est : %s

source: History
fr_fr: Historique

source: Home
fr_fr: Maison

source: Host
fr_fr: Hôte

source: Host of your name server:
fr_fr: Nom d'hôte de votre serveur de nom:

source: Host:
fr_fr: Nom d'hôte

source: How will this web area be used:
fr_fr: À quoi va servir cet espace web:

source: However this list require approval for new subscribers.
fr_fr: Cependant, cette liste nécessite une validation des nouveaux inscrits.

source: However you are (%s) already subscribed to this list.
fr_fr: Cependant vous (%s) êtes déjà inscrit(e) à cette liste.

source: I've lost my password
fr_fr: J'ai perdu mon mot de passe

source: IPv4 address:
fr_fr: Adresse IPv4:

source: IPv6 address:
fr_fr: Adresse IPv6:

source: IRC nick is not correct !
fr_fr: Le pseudonyme sur IRC n'est pas valide !

source: IRC nickname:
fr_fr: Surnom IRC:

source: If you are new to VHFFS, you should start to read briefly the whole <a href="%s">help</a> available.
fr_fr: Si vous n'avez jamais utilisé VHFFS, vous devriez parcourir rapidement la totalité de <a href="%s">l'aide</a> disponible.

source: If you don't asked to be subscribed to this mailing list, just forget this email
fr_fr: Si vous n'avez pas demandé à être inscrit à cette liste de diffusion, merci de ne pas tenir compte de ce mail

source: If you haven't asked to be unsubscribed from this list, please don't answer to this mail
fr_fr: Si vous n'avez pas demandé à être désinscrit à cette liste de diffusion, merci de ne pas répondre à ce mail

source: If you want more disk space for your project, please contact the administrators through the <a href="?do=contact">contact form</a>. Don't forget to mention the name of the group.
fr_fr: Si vous voulez plus d'espace disque pour votre projet, merci de contacterles administrateurs via le <a href="?do=contact">formulaire de contact form</a>. N'oubliez pas d'indiquer le nom du groupe concerné.

source: If you want to create a new category, you have to create a new tag too
fr_fr: Si vous voulez créer une nouvelle catégorie, vous devez également créer un nouveau tag

source: In minutes, at which interval this cron should be started, the minimum interval is set to %d minutes
fr_fr: En minutes, à quel intervalle de temps ce cron devrait être démarré, l'intervalle minimum étant défini à %d minutes

source: Invalid IP address
fr_fr: Adresse IP invalide

source: Invalid IP v6 address
fr_fr: Adresse IP v6 invalide

source: Invalid alias
fr_fr: Redirection invalide

source: Invalid category
fr_fr: Catégorie non valide.

source: Invalid cronpath, it must contain only letters, numbers, underscore, dash, dot or slash. A valid cronpath will be something like /home/group/script.sh)
fr_fr: Chemin du Cron invalide, il ne doit contenir que des lettres, des chiffres, des underscores, des tirets, des points ou des slashs. Un exemple de chemin valide serait /home/groupe/script.sh

source: Invalid database name, it must contain only numbers, lowercase letters and underscore (the latter isn't allowed in first or last position) and be between 3 and 32 characters.
fr_fr: Nom de base de données invalide, il ne doit contenir que des nombres, des lettres minuscules ou des underscores (ces derniers ne devant pas être en première ou dernière position) et contenir entre 3 et 12 caractères.

source: Invalid destination
fr_fr: Destination invalide

source: Invalid destination domain name
fr_fr: Destination de nom de domaine invalide

source: Invalid destination host
fr_fr: Destination host invalide

source: Invalid domain name
fr_fr: Nom de domaine invalide

source: Invalid host
fr_fr: hôte invalide

source: Invalid hostname
fr_fr: Nom d'hôte invalide

source: Invalid interval, it must be a positive integer
fr_fr: Intervalle non valide, ce doit être un entier positif.

source: Invalid local part
fr_fr: Partie locale invalide

source: Invalid mailing list address
fr_fr: Adresse de liste de diffusion invalide

source: Invalid password. It must contain at least 3 characters
fr_fr: Mot de passe incorrect, il doit contenir au moins 3 caractères

source: Invalid port
fr_fr: Port invalide

source: Invalid prefix
fr_fr: Prefixe invalide

source: Invalid priority
fr_fr: Priorité invalide

source: Invalid protocol syntax
fr_fr: Syntaxe de protocole invalide

source: Invalid quota
fr_fr: Quota invalide

source: Invalid record
fr_fr: Enregistrement invalide

source: Invalid reponame. It must contain between 3 and 64 characters, only lowercase letters and numbers
fr_fr: Nom d'espace de téléchargement invalide. Il doit contenir entre 3 et 64 caractères et ne contenir que des chiffres ou des lettres en minuscule.

source: Invalid repository name. It must contain between 3 and 64 characters, only lowercase letters and numbers
fr_fr: Nom de dépôt invalide. Il doit contenir entre 3 et 64 caractères, tous en minuscules, et uniquement de lettres et de chiffres

source: Invalid servername (doesn't conform to domain names rules)
fr_fr: Servername invalide (ne se conforme pas aux règles du nom de domaine)

source: Invalid service syntax
fr_fr: Syntaxe de service invalide

source: Invalid username, it must contain between 3 and 12 alphanumeric characters, all in lowercase
fr_fr: Le nom d'utilisateur doit contenir entre 3 et 12 caractères, tous en minuscule

source: Invalid visibility
fr_fr: Visibilité non valide.

source: Invalid weight
fr_fr: Poids invalide

source: Is a mailing list
fr_fr: Est une liste de diffusion

source: Is this a public repository?
fr_fr: Est-ce un dépôt public ?

source: Label:
fr_fr: Étiquette:

source: Last name
fr_fr: Nom de famille

source: Last name:
fr_fr: Nom de famille:

source: Last projects
fr_fr: Derniers projets

source: Last return code:
fr_fr: Dernier code retour:

source: Last run:
fr_fr: Dernier lancement:

source: Last users
fr_fr: Derniers utilisateurs

source: Lastname is not correct !
fr_fr: Le nom est incorrect !

source: Lastname:
fr_fr: Nom de famille:

source: Latest projects on %s
fr_fr: Derniers projets sur %s

source: List
fr_fr: Liste

source: List all Bazaar repos
fr_fr: Lister tous les dépôts Bazaar

source: List all CVS repos
fr_fr: Lister tous les dépôts CVS

source: List all Git repos
fr_fr: Lister tous les dépôts Git

source: List all Mercurial repos
fr_fr: Lister tous les dépôts Mercurial

source: List all MySQL databases
fr_fr: Lister toutes les bases de données MySQL

source: List all Pg databases
fr_fr: Lister toutes les bases de données PostgreSQL

source: List all SVN repos
fr_fr: Lister tous les dépôts SVN

source: List all cron jobs
fr_fr: Lister tous les jobs Cron

source: List all domain names
fr_fr: Lister tous les noms de domaine

source: List all download repositories
fr_fr: Lister tous les espaces de téléchargement

source: List all groups
fr_fr: Lister tous les groupes

source: List all mail domains
fr_fr: Lister tous les domaines mails

source: List all mailing lists
fr_fr: Lister toutes les listes de diffusion

source: List all objects
fr_fr: Lister tous les objets

source: List all users
fr_fr: Lister tous les utilisateurs

source: List all webareas
fr_fr: Lister tous les espaces web

source: List of all CVS repositories
fr_fr: Liste de tous les dépôts CVS

source: List of all DNS
fr_fr: Liste de tous les DNS

source: List of all MySQL databases
fr_fr: Liste de toutes les bases de données MySQL

source: List of all PostgreSQL databases
fr_fr: Liste de toutes les bases de données PostgreSQL

source: List of all bazaar repositories
fr_fr: Liste de tous les dépôts Bazaar

source: List of all cron jobs
fr_fr: Liste de toutes les tâches Cron

source: List of all download repositories
fr_fr: Liste de tous les espaces de téléchargements

source: List of all git repositories
fr_fr: Liste de tous les dépôts Git

source: List of all groups
fr_fr: Liste de tous les groupes

source: List of all mail domains
fr_fr: Liste de tous les domaines mails

source: List of all mailing lists
fr_fr: Liste de toutes les listes de diffusion

source: List of all mercurial repositories
fr_fr: Liste de tous les dépôts Mercurial

source: List of all objects
fr_fr: Liste de tous les objets

source: List of all subversion repositories
fr_fr: Liste de tous les dépôts Subversion

source: List of all users
fr_fr: Liste de tous les utilisateurs

source: List of all web areas
fr_fr: Liste de tous les espaces web

source: List updated
fr_fr: La liste a été mise à jour

source: Lists waiting for moderation:
fr_fr: Listes de diffusion en attente de modération:

source: Local part (left side of the @):
fr_fr: Partie locale (partie gauche du @):

source: Log in
fr_fr: Identification

source: Login failed !
fr_fr: Authentification échouée !

source: Logout
fr_fr: Se déconnecter

source: Lost password
fr_fr: Mot de passe perdu

source: MX Record added
fr_fr: Enregistrement MX ajouté

source: MX Record deleted
fr_fr: Enregistrement MX supprimé

source: MX Record updated
fr_fr: Enregistrement MX mis à jour

source: MX name:
fr_fr: Nom d'hôte du MX:

source: MX priority:
fr_fr: Priorité du MX:

source: MX records (mail servers)
fr_fr: Enregistrements MX (serveurs mails)

source: Mail Administration for domain
fr_fr: Administration des mails pour le domaine

source: Mail Domain
fr_fr: Domaine mail

source: Mail boxes:
fr_fr: Boîtes mail:

source: Mail deleted
fr_fr: Email supprimé

source: Mail domain successfully created !
fr_fr: Domaine Mail créé avec succès !

source: Mail domains
fr_fr: Domaines mail

source: Mail domains Admin
fr_fr: Administration des domaines mail

source: Mail domains for %s
fr_fr: Domaines mail pour %s

source: Mail domains waiting for moderation:
fr_fr: Noms de domaines en attente de modération:

source: Mail domains' administration
fr_fr: Administration des domaines mail

source: Mail for the list:
fr_fr: Mail de la liste:

source: Mail search
fr_fr: Recherche de domaines mail

source: Mail to all hosted people
fr_fr: Envoyer un message à tous les hébergés

source: Mail to:
fr_fr: Mail à:

source: Mail with id %s
fr_fr: Mail avec l'identifiant %s

source: Mailbox modified
fr_fr: Boîte mail modifiée

source: Mailbox password changed
fr_fr: Mot de passe de boîte changé

source: Mailbox successfully added
fr_fr: Boîte mail ajoutée avec succès

source: Mailing List
fr_fr: Liste de diffusion

source: Mailing Lists
fr_fr: Listes de diffusion

source: Mailing list %s@%s not found
fr_fr: La liste de diffusion %s@%s n'a pas été trouvée

source: Mailing list address is invalid
fr_fr: L'adresse de la liste de diffusion est invalide

source: Mailing lists
fr_fr: Listes de diffusion

source: Mailing lists Admin
fr_fr: Administration des listes de diffusion

source: Mailing lists administration
fr_fr: Administration des listes de diffusion

source: Mailing lists for %s
fr_fr: Listes de diffusion pour %s

source: Mailing lists search
fr_fr: Recherche de listes de diffusion

source: Mailing not found
fr_fr: Diffusion en masse non trouvée

source: Mailing successfully added
fr_fr: Envoi ajouté avec succès

source: Mailing successfully deleted
fr_fr: Envoi supprimé avec succès

source: Mailings to hosted people
fr_fr: Mail à tous les hébergés

source: Manage existing categories
fr_fr: Gérer les catégories existantes

source: Manage existing tags
fr_fr: Gérer les tags existants

source: Manage mailings
fr_fr: Gérer les envois de masse

source: Manage members
fr_fr: Gérer les membres

source: Manage request
fr_fr: Gestion de la requête

source: Manage requests
fr_fr: Gérer les requêtes

source: Matches
fr_fr: Correspond

source: Max tags for a group:
fr_fr: Groupe avec le plus de tags:

source: Member
fr_fr: Membre

source: Members only
fr_fr: Réservé aux membres

source: Members only, moderated
fr_fr: Membres seulement, modéré

source: Mercurial Admin
fr_fr: Administration des dépôts Mercurial

source: Mercurial Repositories
fr_fr: Dépôts Mercurial

source: Mercurial Repository
fr_fr: Dépôt Mercurial

source: Mercurial repositories
fr_fr: Dépôts Mercurial

source: Mercurial repositories administration
fr_fr: Administration des dépôts Mercurial

source: Mercurial repositories for %s
fr_fr: Dépôts Mercurial pour %s

source: Mercurial search
fr_fr: Recherche de dépôts Mercurial

source: Mercurial waiting for moderation:
fr_fr: Dépôts Mercurial en attente de modération

source: Message sent by the following account
fr_fr: Message envoyé par le compte suivant

source: Message sent successfully
fr_fr: Message envoyé avec succès

source: Message with id: %s
fr_fr: Message avec l'identifiant : %s

source: Moderated for everyone
fr_fr: Modéré pour tout le monde

source: Moderation
fr_fr: Modération

source: Moderator
fr_fr: Modérateur

source: Moderator account
fr_fr: Compte du modérateur

source: Moderators
fr_fr: Modérateurs

source: Moderators:
fr_fr: Modérateurs:

source: Modification applied
fr_fr: Modification(s) appliquée(s)

source: Modification error
fr_fr: Erreur lors de la modification

source: Modifications applied. Please wait while your repository is being updated
fr_fr: Modifications appliquées avec succès. Veuillez patienter pendant la mise à jour de votre repository.

source: Modify
fr_fr: Modifier

source: Modify Bazaar repository
fr_fr: Modifier un dépôt Bazaar

source: Modify Git repository
fr_fr: Modifier un dépôt Git

source: Modify Mercurial repository
fr_fr: Modifier un dépôt Mercurial

source: Modify Subversion repository
fr_fr: Modifier un dépôt Subversion

source: Modify webarea
fr_fr: Modifier un espace web

source: Modifying NS records configuration could lead to serious problem. Proceed with caution.
fr_fr: Modifier les enregistrements NS peut poser de gros problèmes. Procédez avec prudence.

source: More info...
fr_fr: Plus d'information...

source: More...
fr_fr: Plus...

source: Moreover all associated services will be DESTROYED
fr_fr: De plus, tous les services associés seront détruits.

source: My Projects
fr_fr: Mes groupes/projets

source: MySQL Admin
fr_fr: Administateur MySQL

source: MySQL Administration
fr_fr: Administration MySQL

source: MySQL DB
fr_fr: Base MySQL

source: MySQL DBs for %s
fr_fr: Bases MySQL pour %s

source: MySQL DBs waiting for moderation:
fr_fr: Bases de données MySQL en attente de modération:

source: MySQL database name:
fr_fr: Nom de la base de données MySQL:

source: MySQL databases
fr_fr: Bases de données MySQL

source: MySQL databases administration
fr_fr: Administration des bases de données MySQL

source: MySQL password for this database:
fr_fr: Mot de passe de cette base de données MySQL:

source: MySQL search
fr_fr: Recherche de bases de données MySQL

source: NS Record added
fr_fr: Enregistrement NS ajouté

source: NS Record deleted
fr_fr: Enregistrement NS supprimé

source: NS records for this domain (nameservers)
fr_fr: Enregistrements NS pour ce domaine (serveurs de noms)

source: Name
fr_fr: Nom

source: Name for the record:
fr_fr: Nom de l'enregistrement:

source: Name of the database:
fr_fr: Nom de cette base de donnée:

source: Name of the record:
fr_fr: Nom de cet enregistrement:

source: Never run
fr_fr: Jamais executé

source: New
fr_fr: Créer

source: New description:
fr_fr: Nouvelle description:

source: New language is: %s
fr_fr: La nouvelle langue est : %s

source: New password:
fr_fr: Nouveau mot de passe:

source: New quota:
fr_fr: Nouveau quota:

source: Next run scheduled at:
fr_fr: Le prochain lancement est prévu à:

source: No
fr_fr: Non

source: No CNAME record for this domain.
fr_fr: Pas d'enregistrement CNAME sur ce domaine.

source: No MX record for this domain
fr_fr: Pas d'enregistrement MX sur ce domaine.

source: No NS record for this domain (do not expect anything to work).
fr_fr: Pas d'enregistrement NS sur ce domaine (n'espérez pas que quoi que ce soit fonctionne).

source: No SRV records for this domain.
fr_fr: Pas d'enregistrement SRV sur ce domaine.

source: No TXT records for this domain.
fr_fr: Pas d'enregistrement TXT sur ce domaine.

source: No category found.
fr_fr: Aucune catégorie trouvée.

source: No cookie found, please accept the cookie and then please login again !
fr_fr: Aucun cookie n'a été trouvé. Merci d'accepter les cookies puis de vous réauthentifier.!

source: No group found
fr_fr: Aucun groupe trouvé

source: No history information about this object.
fr_fr: Pas d'historique disponible sur cet objet.

source: No mailing recorded.
fr_fr: Aucun envoi en masse existant.

source: No message found or it was already moderated by someone else
fr_fr: Le message n'a pas été trouvé ou alors il a déjà été modéré par quelqu'un d'autre

source: No message to moderate
fr_fr: Aucun message à modérer
