Repository: najamelan/vhffs-4.5
Catalog: branches/vhffs-4.5/vhffs-intl/*.po
Languages: fr_fr

source: To refuse this subscriber, send a message to
fr_fr: Pour refuser cet inscrit, envoyez un message à

source: Total groups count:
fr_fr: Nombre total de groupes:

source: Total users count:
fr_fr: Nombre total d'utilisateurs:

source: Unable to add A record: %s
fr_fr: Impossible d'ajouter un enregistrement de type A : %s

source: Unable to add AAAA record: %s
fr_fr: Impossible d'ajouter un enregistrement de type AAAA : %s

source: Unable to add CNAME record: %s
fr_fr: Impossible d'ajouter un enregistrement de type CNAME : %s

source: Unable to add MX record: %s
fr_fr: Impossible d'ajouter un enregistrement de type MX : %s

source: Unable to add NS record: %s
fr_fr: Impossible d'ajouter un enregistrement de type NS : %s

source: Unable to add SRV record: %s
fr_fr: Impossible d'ajouter un enregistrement de type SRV : %s

source: Unable to add TXT record: %s
fr_fr: Impossible d'ajouter un enregistrement de type TXT : %s

source: Unable to add forward %s
fr_fr: Impossible d'ajouter la redirection %s

source: Unable to add tag, check it was not already added to your project
fr_fr: Impossible d'ajouter le tag, vérifiez qu'il n'était pas déjà ajouté à votre projet

source: Unable to add user, he might already be in the group (waiting for addition or deletion)
fr_fr: Impossible d'ajouter l'utilisateur, il doit être déjà dans le groupe (en cours d'ajout ou de suppression)

source: Unable to apply changes
fr_fr: Impossible d'appliquer les modifications

source: Unable to apply modifications
fr_fr: Impossible d'appliquer les modifications

source: Unable to apply modifications, please try again later
fr_fr: Impossible d'appliquer les modifications, veuillez réessayer plus tard

source: Unable to change rights for subscriber %s
fr_fr: Impossible de changer les droits pour le membre %s

source: Unable to create category
fr_fr: Impossible de créer la catégorie

source: Unable to create tag
fr_fr: Impossible de créer le tag

source: Unable to delete A record: %s
fr_fr: Impossible de supprimer l'enregistrement de type A : %s

source: Unable to delete AAAA record: %s
fr_fr: Impossible de supprimer l'enregistrement de type AAAA : %s

source: Unable to delete CNAME record: %s
fr_fr: Impossible de supprimer l'enregistrement de type CNAME : %s

source: Unable to delete MX record: %s
fr_fr: Impossible de supprimer l'enregistrement de type MX : %s

source: Unable to delete NS record: %s
fr_fr: Impossible de supprimer l'enregistrement de type NS : %s

source: Unable to delete SRV record: %s
fr_fr: Impossible de supprimer l'enregistrement de type SRV : %s

source: Unable to delete TXT record: %s
fr_fr: Impossible de supprimer l'enregistrement de type TXT : %s

source: Unable to delete box %s
fr_fr: Impossible de supprimer la boite %s

source: Unable to delete catchall %s
fr_fr: Impossible de supprimer le fourre-tout %s

source: Unable to delete category
fr_fr: Impossible de supprimer la catégorie

source: Unable to delete forward %s to %s
fr_fr: Impossible de supprimer la redirection %s vers %s

source: Unable to delete tag
fr_fr: Impossible de supprimer le tag

source: Unable to find default redirection address, please contact administrators
fr_fr: Impossible de trouver l'adresse de redirection par défaut, merci de contacter les administrateurs

source: Unable to get Bazaar repositories
fr_fr: Impossible de lister les depôts Bazaar

source: Unable to get CVS repositories
fr_fr: Impossible d'obtenir les dépôts CVS

source: Unable to get DNS
fr_fr: Impossible d'obtenir les noms de domaine

source: Unable to get Git repositories
fr_fr: Impossible de récupérer les dépôts Git

source: Unable to get Mercurial repositories
fr_fr: Impossible de lister les dépôts Mercurial

source: Unable to get MySQL databases.
fr_fr: Impossible d'obtenir les bases de données MySQL

source: Unable to get PostgreSQL databases.
fr_fr: Impossible de récupérer les bases de données PostgreSQL

source: Unable to get SVN repositories
fr_fr: Impossible d'obtenir les dépôts SVN

source: Unable to get cron jobs
fr_fr: Impossible de lister les jobs Cron

source: Unable to get download repositories
fr_fr: Impossible de récupérer les espaces de téléchargements

source: Unable to get information on mail domain %s
fr_fr: Impossible d'obtenir des information sur le domain mail %s

source: Unable to get mail domains
fr_fr: Impossible d'obtenir les domaines mails

source: Unable to get webareas
fr_fr: Impossible d'obtenir les espaces web

source: Unable to modify A record: %s
fr_fr: Impossible de modifier l'enregistrement de type A : %s

source: Unable to modify AAAA record: %s
fr_fr: Impossible de modifier l'enregistrement de type AAAA : %s

source: Unable to modify CNAME record: %s
fr_fr: Impossible de modifier l'enregistrement de type CNAME : %s

source: Unable to modify MX record: %s
fr_fr: Impossible de modifier l'enregistrement de type MX : %s

source: Unable to modify SRV record: %s
fr_fr: Impossible de modifier l'enregistrement de type SRV : %s

source: Unable to modify TXT record: %s
fr_fr: Impossible de modifier l'enregistrement de type TXT : %s

source: Unable to modify forward %s
fr_fr: Impossible de modifier la redirection %s

source: Unable to remove user from group
fr_fr: Impossible de supprimer l'utilisateur du groupe

source: Unable to save object
fr_fr: Impossible de sauver l'objet

source: Unable to update category
fr_fr: Impossible de mettre à jour la catégorie

source: Unable to update repository
fr_fr: Impossible de mettre à jour le dépôt

source: Unable to update tag
fr_fr: Impossible de mettre à jour le tag

source: Unable to update user, please try again later
fr_fr: Impossible de mettre à jour l'utilisateur, veuillez réessayer plus tard.

source: Unknow command
fr_fr: Commande inconnue

source: Unknown
fr_fr: Inconnu

source: Unknown error
fr_fr: Erreur inconnue

source: Unsubscribe for the list %s was not complete.
fr_fr: La désinscription pour la liste %s n'est pas complète.

source: Update
fr_fr: Mettre à jour

source: Update IRC nick
fr_fr: Mettre à jour le surnom IRC

source: Update Tag Category
fr_fr: Mettre à jour la catégorie de tags

source: Update forward
fr_fr: Mettre à jour la redirection

source: Update logo
fr_fr: Mettre à jour le logo

source: Update my avatar
fr_fr: Mettre à jour mon avatar

source: Update permissions
fr_fr: Mettre à jour les droits

source: Update quota
fr_fr: Mettre à jour le quota

source: Updated
fr_fr: Mis à jour

source: Uploaded file is too big. The maximum size is 200 kbytes
fr_fr: Le fichier téléversé est trop gros. La taille maximum autorisée est de 200 kbytes.

source: Use @ for ORIGIN (%s)
fr_fr: Utiliser @ pour l'ORIGINE (%s)

source: Use VHFFS servers to manage this mail.
fr_fr: Utiliser les serveurs mails de VHFFS pour gérer ce mail.

source: Use our servers as destination IP for this A record?
fr_fr: Utiliser nos serveurs comme IP cible pour cet enregistrement A ?

source: Use our servers as destination IP for this AAAA record?
fr_fr: Utiliser nos serveurs en tant que destination pour cet enregistrement AAAA?

source: Used tags/existing:
fr_fr: Nombre de tags utilisés/nombre de tags existants:

source: User
fr_fr: Utilisateur

source: User Admin
fr_fr: Administration des Utilisateurs

source: User Preferences
fr_fr: Préférences utilisateur

source: User account
fr_fr: Compte utilisateur

source: User does not exist
fr_fr: L'utilisateur n'existe pas

source: User is not active yet
fr_fr: L'utilisateur n'est pas encore actif

source: User not found
fr_fr: Utilisateur Introuvable

source: User search
fr_fr: Rechercher un utilisateur

source: User successfully updated
fr_fr: L'utilisateur a été supprimé avec succès

source: User will be added as soon as possible
fr_fr: L'utilisateur sera ajouté le plus rapidement possible

source: User's avatar
fr_fr: Avatar de l'utilisateur

source: User's permissions
fr_fr: Permissions de l'utilisateur

source: User's permissions:
fr_fr: Droits de l'utilisateur:

source: Username
fr_fr: Nom d'utilisateur

source: Username for this database:
fr_fr: Nom d'utilisateur de cette base de données:

source: Username:
fr_fr: Nom d'utilisateur:

source: Users
fr_fr: Utilisateurs

source: Users currently in this group
fr_fr: Utilisateurs actuellement présent dans ce groupe

source: Users search
fr_fr: Rechercher des utilisateurs

source: Users' administration
fr_fr: Administration des utilisateurs

source: Validation refused
fr_fr: Validation refusée

source: View
fr_fr: Voir

source: Virus status updated
fr_fr: La protection anti virus a été mise à jour

source: Visibility
fr_fr: Visibilité

source: Visibility:
fr_fr: Visibilité:

source: Waiting for activation
fr_fr: En attente d'activation

source: Waiting for approval
fr_fr: En attente de validation

source: Waiting for confirmation
fr_fr: En attente de confirmation

source: Waiting for creation
fr_fr: En attente de création

source: Waiting for deletion
fr_fr: En attente de suppression

source: Waiting for modification
fr_fr: En attente de modification

source: Waiting for suspension
fr_fr: En attente de suspension

source: Waiting for validation
fr_fr: En attente de validation

source: Wanted language is not in the language list
fr_fr: Le langage voulu n'est pas dans la liste des langages disponibles

source: Wanted shell is not in the shell list
fr_fr: Le shell demandé n'est pas disponible

source: Wanted theme is not in the theme list
fr_fr: Le theme voulu n'est pas dans la liste des thèmes disponibles

source: Warn the admin team
fr_fr: Informer l'équipe d'administration

source: Warning, password change isn't immediate, you've to check periodically to see if it's done
fr_fr: Attention, le changement de mot de passe n'est pas immédiat, vous devez vérifier de temps en temps que l'opération a été effectuée

source: We confirm that you REFUSED the subscription of: %s to the following mailing list: %s
fr_fr: Nous confirmons que vous avez REFUSÉ l'inscription de : %s à la liste de diffusion suivante : %s

source: We confirm that you accepted the subscription of: %s to the following mailing list: %s
fr_fr: Nous confirmons que vous avez accepté l'inscription de : %s à la liste de diffusion suivante : %s

source: We offer you the possibility to forward emails from %s@%s.
fr_fr: Nous vous offrons la possibilité de rediriger les emails depuis %s@%s.

source: We offer you the possibility to have one email box on the domain %s
fr_fr: Nous vous offrons la possibilité de bénéficier d'un compte mail sur le domaine %s

source: Web Admin
fr_fr: Administration web

source: Web area administration
fr_fr: Administration des espaces web

source: Web area successfully modified
fr_fr: Le site web a été modifié avec succès

source: Webarea
fr_fr: Espace web

source: Webarea waiting for moderation:
fr_fr: Espaces web en attente de modération:

source: Webareas
fr_fr: Sites web

source: Webareas for %s
fr_fr: Espaces web pour %s

source: Webareas search
fr_fr: Recherche de sites web

source: Webareas' administration
fr_fr: Administration des espaces web

source: Websites
fr_fr: Sites webs

source: Weight
fr_fr: Poids

source: Weight:
fr_fr: Poids:

source: Welcome on %s
fr_fr: Bienvenue sur %s

source: Will be deleted
fr_fr: Sera détruit

source: Woah, %s users and %s groups already trust %s
fr_fr: Youhou, %s utilisateurs et %s groupes font déjà confiance à %s

source: Yes
fr_fr: Oui

source: Yes I'm sure of what I do
fr_fr: Oui, je suis sûr de ce que je fais

source: Yes I'm sure of what I do, I do not know the fear.
fr_fr: Oui, je suis certain de ce que je fais, je ne connais pas la peur.

source: You are not a subscriber on this list.
fr_fr: Vous n'êtes pas inscrit sur la liste.

source: You are not allowed to access this page
fr_fr: Vous n'êtes pas autorisé à accéder à cette page

source: You are not allowed to add members (ACL rights)
fr_fr: Vous n'êtes pas autorisé à ajouter des membres (droits ACL insuffisants)

source: You are not allowed to do it, you don't own this object
fr_fr: Vous n'êtes pas autorisé à faire ceci, vous n'êtes pas propriétaire de cet objet

source: You are not allowed to manager subscribers' rights (ACL rights)
fr_fr: Vous n'êtes pas autorisé pour modifier les droits des inscrits (droits ACL)

source: You are not allowed to modify this object
fr_fr: Vous n'êtes pas autorisé à modifier cet objet

source: You are not allowed to modify this web area
fr_fr: Vous n'êtes pas autorisé à modifier ce site web

source: You asked to be subscribed to the following list: %s
fr_fr: Vous avez demandé à être inscrit sur cette liste de diffusion: %s

source: You can adjust rights on this group for each user in the VHFFS database. Please read help before manage it.
fr_fr: Vous pouvez ajuster les droits pour chaque utilisateur de ce groupe. Veuillez lire l'aide avant d'effectuer des modifications.

source: You can also send a command list in the mail body.
fr_fr: Vous pouvez également envoyer une liste de commandes dans le corps du mail.

source: You can chose some tags to be applied to your group right now. More tags will be available in your project's preferences once it is created.
fr_fr: Vous pouvez dès à présent choisir des tags pour vore groupe. Des tags supplémentaires seront disponibles dans les préférences de votre projet après sa création.

source: You can either accept the request (and possibly change the name of the tag/category) or reattach it to an existing category and/or tag. If you choose to create a category, you've to create the tag too.
fr_fr: Vous pouvez soit accepter la requête (et changer au passage le nom du tag ou de la catégorie), soit réattacher le tags à une catégorie existante ou un tag. Si vous choisissez de créer une catégorie, vous devez créer le tag aussi.

source: You can only delete requests attached to your group
fr_fr: Vous ne pouvez supprimer que les requêtes rattachées à votre groupe

source: You can upload a custom logo for your group.
fr_fr: Vous pouvez téléverser un logo pour votre groupe.

source: You cannot add NS records on origin
fr_fr: Vous ne pouvez pas ajouter des enregistrements NS sur l'origine

source: You cannot delete NS records on origin
fr_fr: Vous ne pouvez pas supprimer les enregistrements NS sur l'origine

source: You cannot remove the owner of the group
fr_fr: Vous ne pouvez pas supprimer le propriétaire du groupe

source: You cannot subscribe to VHFFS
fr_fr: Vous ne pouvez pas vous inscrire

source: You cannot unsubscribe from the list %s
fr_fr: Vous ne pouvez pas vous désinscrire de la liste %s

source: You demand was refused
fr_fr: Votre demande a été refusée

source: You do not own this domain !
fr_fr: Vous n'êtes pas propriétaire de ce domaine !

source: You don't have enough privileges to add this tag
fr_fr: Vous n'avez pas assez de privilèges pour ajouter ce tag

source: You don't have enough privileges to delete this tag
fr_fr: Vous n'avez pas assez de privilèges pour supprimer ce tag

source: You have been successfully removed from the following list: %s
fr_fr: Vous avez été supprimé avec succès de la liste de diffusion suivante: %s

source: You have been successfully removed from the list %s.
fr_fr: Vous avez été supprimé de la liste %s avec succès.

source: You have been successfully subscribed to the following mailing list: %s
fr_fr: Vous avez été inscrit avec succès à la liste de diffusion suivante: %s

source: You have to enter a description
fr_fr: Vous devez fournir une description

source: You have to enter a label
fr_fr: Vous devez entrer un label

source: You have to enter a label and a description for the category
fr_fr: Vous devez entrer un label et une description pour la catégorie

source: You have to enter a label and a description for the tag
fr_fr: Vous devez saisir un label et une description pour le tag

source: You have to enter a message body
fr_fr: Vous devez entrer un corps de message

source: You have to enter a refuse reason
fr_fr: Vous devez entrer une raison de refus

source: You have to enter a subject
fr_fr: Vous devez entrer un sujet

source: You have to enter an username
fr_fr: Vous devez entrer un nom d'utilisateur

source: You have to select a group first
fr_fr: Vous devez d'abord selectionner un groupe

source: You left your VHFFS session!
fr_fr: Vous avez quitté votre session

source: You lost your password? You're a bad guy!
fr_fr: Vous avez perdu votre mot de passe ? Saimal(tm)

source: You may get some help on listengine by sending an email to
fr_fr: Si vous souhaitez obtenir des informations sur le fonctionnement de la liste, vous pouvrez envoyer un mail à

source: You must choose a method for your mail
fr_fr: Vous devez choisir une méthode de gestion pour votre mail

source: You must confirm your request by sending a confirmation email
fr_fr: Vous devez valider votre demande en envoyant un email de confirmation.

source: You must declare a valid mail address
fr_fr: Vous devez déclarer une adresse mail valide

source: You must declare your city
fr_fr: Vous devez entrer un nom de ville correct

source: You must declare your country
fr_fr: Vous devez entrer un nom de pays correct

source: You must declare your firstname
fr_fr: Vous devez entrer votre prénom

source: You must declare your lastname
fr_fr: Vous devez entrer votre nom

source: You must declare your mail address
fr_fr: Vous devez entrer votre adresse email

source: You must declare your username
fr_fr: Vous devez entrer votre nom d'utilisateur

source: You must declare your zipcode
fr_fr: Vous devez entrer un code postal valide

source: You must enter a description
fr_fr: Vous devez saisir une description

source: You must enter a full name
fr_fr: Vous devez entrer un nom complet

source: You must enter an username
fr_fr: Vous devez entrer un nom d'utilisateur

source: You must specify a project name
fr_fr: Vous devez spécifier un nom de projet

source: You need to enter at least one new member
fr_fr: Vous devez ajouter au moins un nouveau membre

source: You should use use the host pop.%s or imap.%s to fetch your mails.
fr_fr: Vous devez utiliser l'hôte pop.%s ou imap.%s pour récupérer vos mails.

source: You will receive an email with the decision of administrators.
fr_fr: Vous allez recevoir un email avec la décision des administrateurs

source: You're are not allowed to browse panel
fr_fr: Vous n'êtes pas autorisé à parcourir le panel

source: You're not allowed to delete this user
fr_fr: Vous n'êtes pas autorisé à supprimer cet utilisateur

source: You're not allowed to do this (ACL rights)
fr_fr: Vous n'êtes pas autorisé à voir ceci (droits ACL insuffisants)

source: You're not allowed to do this, object is not in active state or you don't have enough ACL rights
fr_fr: Vous n'êtes pas autorisé à faire cela, l'objet n'est pas dans l'état actif ou vous n'avez pas suffisement de droits ACL

source: You're not allowed to manage this object's ACL
fr_fr: Vous n'êtes pas autorisé à modifier les ACL pour cet objet

source: You're not allowed to view this object's ACL
fr_fr: Vous n'êtes pas autorisé à voir l'ACL de ce service

source: Your %s (%s) on %s has been deleted due to lack of updates
fr_fr: Votre %s (%s) sur %s a été supprimé car il n'a pas été mis a jour depuis longtemps

source: Your %s (%s) on %s was successfully created
fr_fr: Votre %s (%s) sur %s a été créé avec succès

source: Your account (%s) on %s has been deleted because it was unused for a long time
fr_fr: Votre compte (%s) sur %s a été supprimé car il n'a pas été utilisé pendant très.longtemps

source: Your message:
fr_fr: Votre message:

source: Your projects
fr_fr: Vos projets

source: Your registration request has been sent. Please wait while we're creating you account, it may take several minutes.
fr_fr: Votre demande d'enregistrement a été envoyée. Veuillez patienter pendant que nous créons votre compte, cela peut prendre quelques minutes.

source: Your request for a %s (%s) on %s was accepted
fr_fr: Votre demande pour un %s (%s) sur %s a été acceptée

source: Your request for a %s (%s) on %s was refused
fr_fr: Votre demande pour un %s (%s) sur %s a été refusée

source: Your subscription was accepted to the following mailing list: %s
fr_fr: Votre inscription a été accepté pour la liste de diffusion suivante : %s

source: Your subscription was refused to the following mailing list: %s Have a nice day.
fr_fr: Votre inscription pour la liste de diffusion suivante a été refusée : %s Merci de votre compréhension.

source: Your zipcode is not correct! Please enter a correct zipcode
fr_fr: Le code postal est incorrect. Veuillez entrer un code postal correct

source: Zipcode
fr_fr: Code postal

source: Zipcode is not correct !
fr_fr: Le code postal n'est pas correct

source: Zipcode:
fr_fr: Code postal:

source: [%s] You've been added to the list %s
fr_fr: [%s] Vous avez été ajouté à la liste %s

source: cannot be removed from the list
fr_fr: ne peut pas être supprimé de la liste

source: cannot be removed.
fr_fr: ne peut pas être supprimé.

source: help - show this help
fr_fr: help - affiche l'aide

source: in the moderation queue of the list %s
fr_fr: dans la queue de modération de la liste %s

source: lang [fr|us|es] - set listengine language
fr_fr: lang [fr|us|es] - modifier la langue de listengine

source: listengine - list of messages to moderate for %s
fr_fr: listengine - liste des messages à modérer pour %s

source: listengine help
fr_fr: aide listengine

source: listengine moderation
fr_fr: modération sur listengine

source: listengine result command
fr_fr: résultat de la commande sur listengine

source: listengine: unknown command
fr_fr: listengine : commande inconnue

source: moderate XXXXX - accept the message with message-id XXXXX
fr_fr: moderate XXXXX - accepter le message ayant l'identifiant XXXXX

source: moderate accept XXXXX - accept the message with message-id XXXXX
fr_fr: moderate XXXXX - accepter le message ayant l'identifiant XXXXX

source: moderate list - give the message list for moderation
fr_fr: moderate list - donner la liste de message à modérer

source: moderate refused XXXXX - refuse the message with message-id XXXXX
fr_fr: moderate refused XXXXX - refuser le message ayant l'identifiant XXXXX

source: no reason given
fr_fr: Pas de raison donnée

source: only lowercase alphanumerical letters, no space, from 3 to 12 characters
fr_fr: uniquement composé de caractères alphanumériques, pas d'espace, de 3 à 12 caractères

source: present in the moderation queue for the list %s
fr_fr: présent dans la queue de modération de la liste %s

source: subscribe - subscribe the shipper to the list
fr_fr: subscribe - souscrire à la liste

source: subscription accept XXXXX - accept the subscription with key XXXXX
fr_fr: subscription accept XXXXX - accepter l'inscription avec la clé XXXXX

source: subscription refuse XXXXX - refuse the subscription with key XXXXX
fr_fr: subscription refuse XXXXX - refuser l'inscription avec la clé XXXXX

source: unsubscribe - unsubscribe from this list
fr_fr: unsubscribe - désinscrire de la liste

source: user info user@domain.tld - show user information
fr_fr: user info user@domain.tld - afficher les informations de l'utilisateur

source: user right RIGHT user@domain.tld - change right for this user
fr_fr: user right RIGHT user@domain.tld - changer les droits pour l'utilisateur spécifié

source: user subscribe user@domain.tld - register the user user@domain.tld on the list
fr_fr: user subscribe user@domain.tld - enregistrer user@domain.tld sur la liste

source: user unsubscribe user@domain.tld - delete user user@domain.tld from list
fr_fr: user unsubscribe user@domain.tld - supprimer l'utilisateur user@domain.tld de la liste

source: was removed from the moderation queue from the list %s
fr_fr: a été supprimé de la queue de modération de la liste %s

source: was sent on the list.
fr_fr: a été envoyé sur la liste
