Repository: najamelan/vhffs-4.5
Catalog: branches/vhffs-4.5/vhffs-intl/*.po
Languages: fr_fr

source: with the following subject : "moderate %s"
fr_fr: avec le sujet : "moderate %s"
