Repository: najamelan/vhffs-4.5
Catalog: branches/vhffs-4.5/vhffs-intl/*.po
Languages: fr_fr

source: No object found
fr_fr: Aucun objet trouvé

source: No object waiting for validation.
fr_fr: Pas d'objet en attente de modération.

source: No registered A records for this domain.
fr_fr: Pas d'enregistrements A sur ce domaine.

source: No registered AAAA records for this domain.
fr_fr: Pas d'enregistrements AAAA sur ce domaine.

source: No tag for this group
fr_fr: Pas de tag pour ce groupe.

source: No tag found.
fr_fr: Pas de tag trouvé.

source: No user for this group.
fr_fr: Pas d'utilisateur pour ce groupe.

source: No user found
fr_fr: Aucun utilisateur trouvé

source: No waiting tag requests.
fr_fr: Aucun tag en attente de modération.

source: No, I'm not sure, I prefer to keep this object. All these warnings scare me.
fr_fr: Non, je ne suis pas certain. Tous ces avertissements me font peur.

source: No, I'm not sure, I'd prefer to keep it.
fr_fr: Non, je ne suis pas certain, je préfère le garder.

source: None
fr_fr: Aucun

source: Notify changes on mailing-list:
fr_fr: Notifier les changements sur cette liste de diffusion:

source: OK, go to ACL management
fr_fr: Aller à la gestion des ACL

source: Object ID
fr_fr: Identifiant de l'objet

source: Object ID:
fr_fr: Identifiant de l'objet:

source: Object accepted
fr_fr: Object accepté

source: Object administration
fr_fr: Administration de l'objet

source: Object history
fr_fr: Historique de l'objet

source: Object label
fr_fr: Étiquette de l'objet

source: Object name:
fr_fr: Nom de l'objet

source: Object not found
fr_fr: Objet non trouvé

source: Object refused
fr_fr: Objet refusé

source: Object search
fr_fr: Recherche d'objets

source: Object type
fr_fr: Type de l'objet

source: Object type:
fr_fr: Type de l'objet:

source: Object updated
fr_fr: Objet mis à jour

source: Objects list
fr_fr: Liste des objets

source: On object
fr_fr: Sur l'objet

source: Only administrators are allowed to do this
fr_fr: Seul les administrateurs sont autorisés à faire cela.

source: Only administrators can do this
fr_fr: Seul les administrateurs peuvent faire cela.

source: Only an administrator can remove someone from a group, please contact the administration team
fr_fr: Seul un administateur peut enlever quelqu'un d'un groupe. Merci de contacterl'équipe d'administration.

source: Only this list administrators can use the following commands.
fr_fr: Les administrateurs de cette liste peuvent utiliser les commandes suivantes.

source: Open for everyone
fr_fr: Ouvert à tous

source: Open for members, moderated for non-members
fr_fr: Ouvert aux membres, modéré pour les non-membres

source: Open, approval required
fr_fr: Ouvert, approbation nécessaire

source: Open, no approval required
fr_fr: Ouvert, pas d'approbation

source: Other tags
fr_fr: Autre tags

source: Overall subscribers count:
fr_fr: Nombre total d'inscrits aux listes

source: Owner
fr_fr: Propriétaire

source: Owner GID:
fr_fr: GID du propriétaire:

source: Owner UID:
fr_fr: UID du propriétaire:

source: Owner group
fr_fr: Groupe propriétaire

source: Owner group for this Bazaar repository:
fr_fr: Groupe possédant ce dépôt Bazaar:

source: Owner group for this CVS repository:
fr_fr: Groupe possédant ce dépôt CVS:

source: Owner group for this Git repository:
fr_fr: Groupe possédant ce dépôt Git:

source: Owner group for this Mercurial repository:
fr_fr: Groupe possédant ce dépôt Mercurial:

source: Owner group for this SVN repository:
fr_fr: Groupe possédant ce dépôt SVN:

source: Owner group for this web area:
fr_fr: Groupe possédant cet espace web:

source: Owner user
fr_fr: Propriétaire de l'objet

source: Owner:
fr_fr: Propriétaire:

source: Panel UI theme:
fr_fr: Theme du panel:

source: Panel language:
fr_fr: Langage du panel:

source: Password
fr_fr: Mot de passe

source: Password (confirm):
fr_fr: Mot de passe (confirmation):

source: Password change request taken in account, please wait for processing
fr_fr: Demande de changement de mot de passe prise en compte, veuillez patienter pendant l'opération

source: Password changed
fr_fr: Mot de passe modifié

source: Password for this database:
fr_fr: Mot de passe pour cette base de données:

source: Password recovery failed!
fr_fr: Le mot de passe n'a pas été retrouvé

source: Password:
fr_fr: Mot de passe:

source: Passwords don't match
fr_fr: Les mots de passe ne correspondent pas

source: Path:
fr_fr: Chemin:

source: Pending tag requests
fr_fr: Tags en attente de modération

source: PgSQL
fr_fr: PostgreSQL

source: PgSQL DB
fr_fr: Base de donnée postgreSQL

source: Platform statistics
fr_fr: Statistiques de la plateforme

source: Platform temporary closed
fr_fr: Plateforme fermée temporairement

source: Please consider that this description is going to be displayed in the public area. So you have to write it in impersonal form. You should take care to write it with correct grammar and tenses. Take all the time you need to fill it with the best content you are able to do.
fr_fr: Veuillez noter que cette description est destinée à être publiée. Vous devez donc l'écrire en forme impersonnelle et faire attention à respecter les temps et les règles de grammaire. Prenez tout le temps nécessaire pour la remplir avec le meilleur contenu que vous pouvez produire.

source: Please enter a correct city
fr_fr: Merci d'entrer un nom de ville correcte

source: Please enter a correct country
fr_fr: Merci d'entrer un nom de pays correct

source: Please enter a correct firstname
fr_fr: Merci d'entrer un prénom correct

source: Please enter a correct lastname
fr_fr: Merci d'entrer un nom correct

source: Please enter your username and password
fr_fr: Veuillez entrer votre nom d'utilisateur et votre mot de passe

source: Please fill in all fields, you'll be sent a mail containing your password
fr_fr: Merci de remplir tous les champs, vous recevrez un mail contenant votre mot de passe

source: Please read help of listengine
fr_fr: Veuillez lire l'aide de listengine

source: Please read the %sdocumentation%s carefully before submitting your request
fr_fr: Merci de lire la %sdocumentation%s attentivement avant d'envoyer votre demande.

source: Please try again !
fr_fr: Veuillez réessayer !

source: Please try again.
fr_fr: Veuillez réessayer.

source: Please wait %s, a new password will be sent to you in a few minutes...
fr_fr: Veuillez patienter %s, un nouveau mot de passe va vous être envoyé dans quelques minutes...

source: Popular tags
fr_fr: Tags populaires

source: PostgreSQL Admin
fr_fr: Administration de la base de donnée PostgreSQL

source: PostgreSQL Administration
fr_fr: Administration des bases PostgreSQL

source: PostgreSQL DBs for %s
fr_fr: Bases PostgreSQL pour %s

source: PostgreSQL DBs waiting for moderation:
fr_fr: Bases de données PostgreSQL en attente de modération:

source: PostgreSQL database name:
fr_fr: Nom de la base de données PostgreSQL:

source: PostgreSQL databases
fr_fr: Base de données PostgreSQL:

source: PostgreSQL databases administration
fr_fr: Administration des bases de données PostgreSQL

source: PostgreSQL password for this database:
fr_fr: Mot de passe pour cette base de données PostgreSQL:

source: PostgreSQL search
fr_fr: Recherche de bases des données PostgreSQL

source: Posting control:
fr_fr: Contrôle des envois:

source: Powered by %s
fr_fr: Propulsé par %s

source: Preferences
fr_fr: Préférences

source: Prefix already exists
fr_fr: Ce préfixe existe déjà

source: Prefix on subject:
fr_fr: Prefixe du sujet:

source: Priority
fr_fr: Priorité

source: Priority:
fr_fr: Priorité:

source: Project
fr_fr: Projet

source: Project History
fr_fr: Historique du projet

source: Project Preferences
fr_fr: Préférences du groupe

source: Project Successfully created !
fr_fr: Projet créé avec succès

source: Project contact
fr_fr: Contact du projet

source: Project description:
fr_fr: Description du projet:

source: Project full name:
fr_fr: Nom complet du projet:

source: Project name:
fr_fr: Nom du projet:

source: Project owner:
fr_fr: Propriétaire du projet:

source: Project search
fr_fr: Recherche de projets

source: Projects
fr_fr: Projets

source: Projects you contribute to
fr_fr: Vos contributions

source: Propose a new description
fr_fr: Proposer une nouvelle description

source: Protocol:
fr_fr: Protocole:

source: Public
fr_fr: Publique

source: Public (available on group creation)
fr_fr: Publique (disponible lors de la création d'un groupe)

source: Public archives
fr_fr: Archives publiques

source: Public area
fr_fr: Partie publique

source: Public area is temporary closed. Administrators are performing some maintenances tasks or system encountered database error. Please come back in a few minutes.
fr_fr: La partie publique est temporairement fermée. Les administrateurs sont entrain de travailler dessus ou alors la base de données n'est pas accessible. Merci de revenir dans quelques minutes.

source: Public area temporary closed
fr_fr: Partie publique temporairement fermée

source: Quota (used/total): %d/%dMB
fr_fr: Quota (utilisé/total): %d/%dMB

source: RSS infos are not published
fr_fr: Les informations ne sont pas publiées au format RSS

source: Random tags
fr_fr: Tags au hasard

source: Read more about this service.
fr_fr: En savoir plus à propos de ce service.

source: Real Name
fr_fr: Nom

source: Reason of refusal:
fr_fr: Raison du refus:

source: Record does not exists
fr_fr: L'enregistrement n'existe pas

source: Record name:
fr_fr: Nom de l'enregistrement:

source: Record type doesn't exists
fr_fr: Ce type d'enregistrement n'existe pas

source: Redirect deleted
fr_fr: Redirection supprimée

source: Redirect updated
fr_fr: Redirection mise à jour

source: Redirects
fr_fr: Redirections

source: Refuse
fr_fr: Refuser

source: Related documentation is available at: %s
fr_fr: La documentation à ce sujet est disponible à: %s

source: Remove
fr_fr: Enlever

source: Report a bug
fr_fr: Rapporter un problème

source: Repository name:
fr_fr: Nom du dépôt:

source: Repository quota
fr_fr: Quota du dépôt

source: Repository updated, please wait while quota is updated on filesystem
fr_fr: Dépôt modifié, veuillez patienter jusqu'à la mise à jour du quota sur le système de fichiers

source: Request a new tag
fr_fr: Demander un nouveau tag

source: Request canceled
fr_fr: Requête annulée

source: Request not found
fr_fr: Requête non trouvée.

source: Requester
fr_fr: Demandeur

source: Requester:
fr_fr: Demandeur:

source: Rights for subscriber %s updated
fr_fr: Les droits pour le membre %s ont été mis a jour

source: Running
fr_fr: En exécution

source: SRV Record added
fr_fr: Enregistrement SRV ajouté

source: SRV Record deleted
fr_fr: Enregistrement SRV supprimé

source: SRV Record updated
fr_fr: Enregistrement SRV mis à jour

source: SRV records (servers)
fr_fr: Enregistrements SRV (serveurs)

source: SVN Admin
fr_fr: Administration du dépôt SVN

source: SVN Repositories
fr_fr: Dépôts SVN

source: SVN Repository
fr_fr: Dépôt subversion

source: SVN repositories for %s
fr_fr: Dépôt subversion pour %s

source: SVN waiting for moderation:
fr_fr: Dépôts SVN en attente de modération:

source: Save options
fr_fr: Sauvegarder les options

source: Search
fr_fr: Chercher

source: Search for a Bazaar repository
fr_fr: Rechercher un dépôt Bazaar

source: Search for a CVS repository
fr_fr: Rechercher un dépôt CVS

source: Search for a Git repository
fr_fr: Rechercher un dépôt Git

source: Search for a Mercurial repository
fr_fr: Rechercher un dépôt Mercurial

source: Search for a MySQL database
fr_fr: Rechercher une base de données MySQL

source: Search for a Pg database
fr_fr: Rechercher une base de données PostgreSQL

source: Search for a SVN repository
fr_fr: Rechercher un dépôt svn

source: Search for a cron job
fr_fr: Rechercher un job Cron

source: Search for a domain name
fr_fr: Recherche d'un nom de domaine

source: Search for a download repository
fr_fr: Rechercher un espace de téléchargement

source: Search for a group
fr_fr: Rechercher un groupe

source: Search for a mail domain
fr_fr: Rechercher un domaine mail

source: Search for a mailing list
fr_fr: Rechercher une liste de diffusion

source: Search for a webarea
fr_fr: Rechercher un espace web

source: Search for an object
fr_fr: Rechercher un objet

source: Search for an user
fr_fr: Rechercher un utilisateur

source: Search result for %s
fr_fr: Résultat de la recherche pour %s

source: Search results
fr_fr: Résultats de la recherche

source: Send
fr_fr: Envoyer

source: Send an email to all hosted people
fr_fr: Envoyer un mail à tous les hébergés

source: Send an email with the subject "help" to the following address:
fr_fr: Envoyez un mail ayant pour sujet "help" à l'adresse suivante :

source: Send my avatar
fr_fr: Envoyer mon avatar

source: Send reports to:
fr_fr: Envoyer les rapports à:

source: Sent
fr_fr: Envoyé

source: Several users matched your query. Please choose between them.
fr_fr: Plusieurs utilisateurs ont été trouvés. Merci de choisir l'un d'entre eux.

source: Sorry, can't add or update ACL
fr_fr: Une erreur est survenue lors de l'ajout ou de la mise à jour de l'ACL

source: Space used:
fr_fr: Espace utilisé:

source: Spam status updated
fr_fr: L'état concernant la protection spam a été mis a jour

source: Stand-by
fr_fr: Endormi

source: State
fr_fr: État

source: State:
fr_fr: État:

source: Status:
fr_fr: État:

source: Subdomain name:
fr_fr: Nom du sous domaine:

source: Subject
fr_fr: Sujet

source: Subject:
fr_fr: Sujet:

source: Subscribe
fr_fr: Inscription

source: Subscribe control:
fr_fr: Contrôle des inscriptions :

source: Subscribe to newsletter
fr_fr: S'inscrire au bulletin

source: Subscribe to the newsletter
fr_fr: Souscrire à la newsletter

source: Subscriber %s deleted
fr_fr: Le membre %s a été supprimé

source: Subscription
fr_fr: Inscription

source: Subscription to the following list is forbidden: %s Have a nice day.
fr_fr: L'inscription à cette liste de diffusion n'est pas autorisé: %s Merci de votre compréhension.

source: Subversion repositories
fr_fr: Dépôts Subversion

source: Subversion repositories administration
fr_fr: Administration des dépôts Subversion

source: Subversion search
fr_fr: Recherche de dépôts Subversion

source: Successfully created or updated avatar
fr_fr: Avatar créé ou modifié avec succès

source: Suspended
fr_fr: Suspendu

source: TXT Record added
fr_fr: Enregistrement TXT ajouté

source: TXT Record deleted
fr_fr: Enregistrement TXT supprimé

source: TXT Record updated
fr_fr: Enregistrement TXT mis à jour

source: TXT records for this domain (textual information)
fr_fr: Enregistrements TXT sur ce domaine (Information textuelle)

source: Tag Requests
fr_fr: Demandes de Tags

source: Tag added
fr_fr: Tag ajouté

source: Tag categories
fr_fr: Catégories de tags

source: Tag category successfully created
fr_fr: Catégorie de tags créée avec succès

source: Tag category successfully updated
fr_fr: Catégorie de tags mise à jour avec succès.

source: Tag deleted
fr_fr: Tag supprimé

source: Tag label
fr_fr: Étiquette du tag

source: Tag label:
fr_fr: Étiquette du tag:

source: Tag name can't be empty
fr_fr: Le nom du tag ne peut pas être vide

source: Tag not found
fr_fr: Tag non trouvé

source: Tag not found!
fr_fr: Tag non trouvé !

source: Tag request accepted
fr_fr: Requête de tag acceptée

source: Tag request deleted
fr_fr: Requête de tag supprimée

source: Tag request details
fr_fr: Détails de la requête de tags

source: Tag request not found
fr_fr: Requête de tag non trouvée

source: Tag request saved, please wait while a moderator approve it
fr_fr: Requête de tag enregistrée, veuillez patienter le temps qu'un modérateur l'approuve

source: Tag successfully created
fr_fr: Tag créé avec succès

source: Tag successfully updated
fr_fr: Tag créé avec succès

source: Tagged groups:
fr_fr: Groupes avec des tags:

source: Tagged object:
fr_fr: Objet avec des tags:

source: Tags Admin
fr_fr: Administration des tags

source: Tags cloud
fr_fr: Nuage de tags

source: Tags cloud / category
fr_fr: Nuage de tags / catégories

source: Tags' administration
fr_fr: Administration des tags

source: Tell us for what purpose you want to create this mail domain:
fr_fr: Dîtes-nous pourquoi vous souhaitez créer ce domaine mail:

source: Tell us what the use of this mailing list will be:
fr_fr: Dîtes-nous pourquoi vous souhaitez créer cette liste de diffusion:

source: Text can't be empty
fr_fr: Le texte ne peut être vide

source: Textual information:
fr_fr: Information textuelle:

source: The Bazaar object was successfully created !
fr_fr: Dépôt Bazaar créé avec succès

source: The CVS object was successfully created !
fr_fr: Dépôt CVS créé avec succès

source: The Cron job was successfully created !
fr_fr: Le job Cron a été créé avec succès !

source: The DNS object was successfully created !
fr_fr: Le nom de domaine a été créé avec succès !

source: The GIT object was successfully created !
fr_fr: Le dépôt Git a été créé avec succès !

source: The Mercurial object was successfully created !
fr_fr: Dépôt Mercurial créé avec succès

source: The MySQL DB was successfully created !
fr_fr: La base de données MySQL a été créée avec succès !

source: The PostgreSQL DB was successfully created !
fr_fr: La base de données PostgreSQL a été créée avec succès !

source: The SVN object was successfully created !
fr_fr: Le dépôt SVN a été créé avec succès !

source: The avatar is a PNG image that will appear next to your username in the public section.
fr_fr: L'avatar est une image PNG qui apparaîtra sur la page vous concernant sur la partie publique.

source: The confirmation code was wrong
fr_fr: Le code de confirmation était erroné

source: The database name is prefixed by your groupname followed by an underscore (%s_dbname). The database user is the database full name (%s_dbname).
fr_fr: Le nom de la base de données est préfixé par votre nom de groupe suivi d'un underscore (%s_dbname). L'utilisateur de la base est le nom complet de la base(%s_dbname).

source: The email you entered fails syntax check
fr_fr: L'adresse email fournie n'a pas passé les tests de validité

source: The first letter of groupname and full name must be the same
fr_fr: La première lettre de votre nom de groupe et du nom complet de votre groupe doit être la même

source: The following address %s is not allowed to execute commands on the list %s
fr_fr: L'adresse suivante %s n'est pas autorisée à exécuter des commandes sur cette liste %s

source: The following address %s is not on the following mailing list: %s
fr_fr: L'adresse suivante : %s n'est pas dans la liste de diffusion suivante : %s

source: The groupname must not be the same as your username
fr_fr: Le nom du groupe ne peut pas être identique à votre nom d'utilisaeur

source: The listengine language preference was changed for the following address %s.
fr_fr: La langue pour l'adresse %s a été changée.

source: The mailing list object was successfully created !
fr_fr: La liste de diffusion a été créé avec succès !

source: The message does not exists or was moderated before you.
fr_fr: Le message n'existe pas ou a été modéré avant votre passage.

source: The message with the following id %s
fr_fr: Le message avec l'identifiant suivant %s

source: The new description has been submitted
fr_fr: La nouvelle description a été soumise

source: The repository was successfully created !
fr_fr: L'espace de téléchargement a été créé avec succès !

source: The state of you subscription was not changed, you are still subscribed
fr_fr: L'état de votre inscription n'a pas été modifiée, vous êtes toujours inscrit

source: The webarea was successfully created !
fr_fr: L'espace web a été créé avec succès !

source: There are two possible usages:
fr_fr: Il a deux utilisations possible:

source: There is a problem with the address you filled in your profile, unable to add forwarding
fr_fr: Il y a un problème avec l'adresse indiqué dans vos informations personnelles. Impossible d'ajouter la redirection.

source: There is no default mail domain on this platform, you have to create a mail domain before creating a mailing list
fr_fr: Il n'y a pas de domaine mail par défaut sur cette plateforme, vous devez créer un domaine mail avant de créer une liste de diffusion

source: This action is non-reversible. This object will be physically destroyed and deleted from the database, there is no way to recover your data.
fr_fr: Cette action n'est pas réversible. Cet objet sera détruit physiquement et supprimé de la base de données, il n'existe aucun moyen de récupérer vos données.

source: This action is non-reversible. Your user will be DESTROYED.
fr_fr: Cette action est irréversible. Votre utilisateur sera DÉTRUIT.

source: This box already exists for this domain or parameters are not valid. Check your domain.
fr_fr: Cette boîte mail existe déjà pour le domaine ou les paramètres transmis ne sont pas valides. Veuillez vérifier votre domaine

source: This group is not activated yet
fr_fr: Le groupe n'est pas encore activé

source: This host is already registered for this service
fr_fr: Cet hôte est déjà enregistré pour ce service

source: This mail must contains the following subject : "confirm unsubscribe %s"
fr_fr: Ce mail doit contenir le sujet suivant : "confirm unsubscribe %s"

source: This mail must have the following subject : "confirm subscribe %s" On most clients it should work by just replying this email
fr_fr: Ce mail doit avoir le sujet suivant : "confirm subscribe %s" Sur la plupart des clients il suffit juste de répondre au mail

source: This mail was sent by %s with the following subject: %s
fr_fr: Ce mail a été envoyé par %s avec pour sujet : %s

source: This object does not exist
fr_fr: Cet objet n'éxiste pas

source: This object does not have an avatar
fr_fr: Cet objet ne possède pas d'avatar

source: This object has been deleted
fr_fr: Cet objet a été supprimé

source: This object is not functional yet. Please wait creation or moderation.
fr_fr: Ce service n'est pas fonctionnel actuellement. Veuillez attendre la création ou la modération

source: This object is not functionnal yet. Please wait creation or moderation.
fr_fr: Ce service n'est pas encore actif. Merci d'attendre la création ou la modération

source: This object is not in refused state
fr_fr: Cet service n'est pas dans l'état refusé

source: This object will NOT be deleted
fr_fr: Cet objet ne sera pas détruit

source: This object will be deleted
fr_fr: Cet objet sera détruit

source: This platform does not provide avatar support
fr_fr: Le support des avatars n'est pas disponible sur cette plate-forme

source: This platform is temporary closed. Administrators are performing some maintenances tasks or system encountered database error. Please come back in a few minutes to log in.
fr_fr: Cette plateforme est temporairement fermée. Les administrateurs sont entrain de travailler dessus ou alors la base de données n'est pas accessible. Merci de revenir dans quelques minutes.

source: This user is still in a group
fr_fr: L'utilisateur est encore dans un groupe

source: This user will BE DELETED
fr_fr: Cet utilisateur sera détruit

source: This user will NOT be DELETED
fr_fr: Cet utilisateur NE sera PAS détruit

source: This user will be removed from this group as soon as possible
fr_fr: Cet utilisateur sera supprimé de ce groupe dès que possible

source: To accept this subscriber, send a message to
fr_fr: Pour accepter cet inscrit, envoyez un message à

source: To avoid blacklisting issues due to spam forwarding, catchall address are restricted to boxes belongin to this mail domain.
fr_fr: Pour éviter les soucis de listes noires à cause des redirections de spams, les adresses fourre-tout sont limitées aux boîtes existantes sur ce domaine.

source: To put this post on the list, send a message to: %s-request@%s
fr_fr: Pour ajouter ce mail à la liste, envoyez un message à : %s-request@%s
